#+TITLE: Pyasn Lookup
Link to this document https://github.com/ii/org/blob/main/research/pyasn-lookup.org#lets-add-asn-results-to-the-dictionary
This is an investigation of https://github.com/hadiasghari/pyasn
Desired outcomes will be to parse the output from this library to tie each asn to it associated start and end ip ints so we can range over them to find customer asns
This document only concerns itself with generating a asn to ip-range relationsip map
* Download and process the latest rib file
You can view the full list on ftp://archive.routeviews.org//bgpdata/2021.05/RIBS/
obviosly adjust for date
to get the latest file simply run:
pip installed the scripts in .local so I am adding it to my path
TODO: Decide how we want to reference these scripts
#+BEGIN_SRC shell :dir (concat (getenv "HOME") "/foo")
export PATH="/home/ii/.local/bin/:$PATH"
pyasn_util_download.py --latest
#+END_SRC

#+RESULTS:
#+begin_example
Connecting to ftp://archive.routeviews.org
Finding most recent archive in /bgpdata/2021.06/RIBS ...
Finding most recent archive in /bgpdata/2021.05/RIBS ...
Downloading ftp://archive.routeviews.org//bgpdata/2021.05/RIBS/rib.20210531.2200.bz2
Download complete.
#+end_example

* Process rib file so we can transform it into a local data file
#+BEGIN_SRC shell :dir (concat (getenv "HOME") "/foo")
ls -al | grep rib
#+END_SRC

#+RESULTS:
#+begin_example
-rw-r--r--  1 ii   ii   124276057 Jun  1 11:35 rib.20210531.2200.bz2
#+end_example

#+BEGIN_SRC shell :dir (concat (getenv "HOME") "/foo")
export PATH="/home/ii/.local/bin/:$PATH"
pyasn_util_convert.py --single rib.20210531.2200.bz2 ipasn_20140531_1.dat
#+END_SRC

#+RESULTS:
#+begin_example
IPASN database saved (923124 IPV4 + 0 IPV6 prefixes)
#+end_example

#+BEGIN_SRC shell :dir (concat (getenv "HOME") "/foo")
ls -alrt | tail -3
#+END_SRC

#+RESULTS:
#+begin_example
-rw-r--r--  1 ii   ii   124276057 Jun  1 11:35 rib.20210531.2200.bz2
-rw-r--r--  1 ii   ii    19939342 Jun  1 11:42 ipasn_20140531_1.dat
#+end_example

* Push to bq (just testing)

#+begin_src shell
bq load --autodetect k8s_artifacts_dataset_bb_test.py_asn_test /home/ii/foo/pyAsnOutput.csv
#+end_src

#+RESULTS:
#+begin_example
It worked!
#+end_example


** Bring up Postgres
#+BEGIN_SRC tmate :window postgres
docker run -it --rm -p 5432:5432 -e POSTGRES_PASSWORD=password -e POSTGRES_DB=ii postgres:12.2-alpine
#+END_SRC
Get ip for pg
#+BEGIN_SRC shell
echo $SHARINGIO_PAIR_LOAD_BALANCER_IP
#+END_SRC

#+RESULTS:
#+begin_example
147.75.109.30
#+end_example

#+BEGIN_SRC sql-mode
\dn
--SELECT schemaname, tablename FROM pg_catalog.pg_tables WHERE schemaname != 'pg_catalog' AND schemaname != 'information_schema';
#+END_SRC

#+RESULTS:
#+begin_SRC example
  List of schemas
  Name  |  Owner
--------+----------
 public | postgres
(1 row)

#+end_SRC

** Load csv into pg
#+BEGIN_SRC sql-mode
create table pyasn_ip_asn  (ip cidr, asn int);
\COPY pyasn_ip_asn from '/home/ii/foo/pyAsnOutput.csv' DELIMITER ',' CSV;
#+END_SRC

#+RESULTS:
#+begin_SRC example
CREATE TABLE
#+end_SRC

Confirmation:
#+BEGIN_SRC sql-mode
select * from pyasn_ip_asn limit 10;
#+END_SRC

#+RESULTS:
#+begin_SRC example
        ip        | asn
------------------+-----
 8.13.230.128/27  |   1
 63.215.96.16/29  |   1
 8.13.232.96/27   |   1
 207.227.228.0/22 |   1
 8.44.88.192/29   |   1
 8.13.231.128/27  |   1
 63.215.98.16/29  |   1
 8.45.87.176/29   |   1
 8.13.231.32/27   |   1
 8.13.227.32/27   |   1
(10 rows)

#+end_SRC

Split that into start and end
#+BEGIN_SRC sql-mode
select asn as asn,
ip as ip,
host(network(ip)::inet) as ip_start,
host(broadcast(ip)::inet) as ip_end
into table pyasn_ip_asn_extended
from pyasn_ip_asn;
#+END_SRC

#+RESULTS:
#+begin_SRC example
SELECT 923058
#+end_SRC

#+BEGIN_SRC sql-mode
select * from pyasn_ip_asn_extended limit 10;
#+END_SRC

#+RESULTS:
#+begin_SRC example
 asn |        ip        |   ip_start    |     ip_end
-----+------------------+---------------+-----------------
   1 | 8.13.230.128/27  | 8.13.230.128  | 8.13.230.159
   1 | 63.215.96.16/29  | 63.215.96.16  | 63.215.96.23
   1 | 8.13.232.96/27   | 8.13.232.96   | 8.13.232.127
   1 | 207.227.228.0/22 | 207.227.228.0 | 207.227.231.255
   1 | 8.44.88.192/29   | 8.44.88.192   | 8.44.88.199
   1 | 8.13.231.128/27  | 8.13.231.128  | 8.13.231.159
   1 | 63.215.98.16/29  | 63.215.98.16  | 63.215.98.23
   1 | 8.45.87.176/29   | 8.45.87.176   | 8.45.87.183
   1 | 8.13.231.32/27   | 8.13.231.32   | 8.13.231.63
   1 | 8.13.227.32/27   | 8.13.227.32   | 8.13.227.63
(10 rows)

#+end_SRC

#+begin_src sql-mode
\copy (select * from pyasn_ip_asn_extended) to '/tmp/pyasn_expanded_ipv4.csv' csv header;
#+end_src

#+RESULTS:
#+begin_SRC example
COPY 923058
#+end_SRC

#+begin_src shell
bq load --autodetect k8s_artifacts_dataset_bb_test.pyasn_ip_asn_extended /tmp/pyasn_expanded_ipv4.csv
#+end_src

#+RESULTS:
#+begin_example
#+end_example

